{"name":"Kevin Khieu","first_name":"Kevin","last_name":"Khieu","title":"Social Good Engineer - Incoming Software Developer Intern at GE Digital","location":"Stanford","country":"California","industry":null,"summary":"Technological advancements have made our world more interconnected, more cognizant, and more empowered than ever before. My goal is to use these capabilities to better the lives of others in any way that I can, specifically in the realm of software development. I grew up ingrained with a strong passion for social good, engaging in numerous charity-related activities for almost all of my educational career. These past experiences have led me to believe that the human condition is naturally altruistic, and it is because of this that I feel there exists a perpetual duty to help others in need. My computer science journey has opened many doors in terms of ways that I envision myself improving the world. Software development has increasingly become a more powerful tool year in and year out, allowing engineers to tackle consumer problems in an innovative and scalable manner. My desire is to bridge my capabilities in computer science with my passion for social good to solve problems people all around the world face in their everyday lives.","picture":null,"projects":[],"linkedin_url":"https://www.linkedin.com/in/kevinkhieu","education":[{"name":"Stanford University","description":"Activities and Societies: Asian-Pacific Student Entrepreneurship Society, CS+Social Good","degree":"Bachelor’s Degree, Computer Science (Human-Computer Interaction Track)","period":"2014 – 2018","start_date":"2014","end_date":"2018"},{"name":"University of Minnesota-Twin Cities","description":"Accepted into the University of Minnesota's Post-Secondary Enrollment Opportunities Program, which allowed me to attend college classes during my high school senior year.","degree":"","period":"2013 – 2014","start_date":"2013","end_date":"2014"},{"name":"Eden Prairie High School","description":"Activities and Societies: Student Government Treasurer, National Honor Society Vice President, Amnesty International President, FACE AIDS President, Math Team Captain, Chess Team Captain, DECA, Economics Team","degree":"High School","period":"2010 – 2014","start_date":"2010","end_date":"2014"}],"groups":[],"websites":[],"languages":[],"skills":["Microsoft Office","Public Speaking","Research","Java","Customer Service","Management","Leadership","C++","C","Event Planning","HTML","Photoshop","CSS","Swift","AutoCAD","JavaScript"],"certifications":[],"organizations":[],"past_companies":[],"current_companies":[],"companies":[{"title":"Software Developer/Founding Member","company":"Telemo Health","description":"Currently working on developing the company's client-side iOS application, which aims to connect clients with registered healthcare providers to help them lead healthier daily lives. I was responsible for completing the last 50% of the app's development, which includes implementing the app's Activity Feed, Appointment Booking, Stripe/Apple Pay Payment Options, Video Chat, and User Profile features. The front-end is coded in Swift, and the back-end is managed using Parse/Javascript. After helping develop the company's mobile app for their initial launch, I was named as an honorary founding member of the company for my efforts.","duration":"3 months","start_date":"2015-12-01","end_date":"2016-02-03","linkedin_company_url":"https://www.linkedin.com/company/telemo-health?trk=ppro_cprof","url":"http://www.TeleMoHealth.com","website":"http://www.TeleMoHealth.com","industry":"Health, Wellness and Fitness","type":"Privately Held","headquarters":"PO Box: 460523\n\nSan Francisco,\nCA\n\nUnited States","company_size":"1-10 employees","founded":"2015","address":"PO Box: 460523  San Francisco, CA  United States"},{"title":"Webpage Administrator","company":"EBR Realty","description":"Starting in 2010, I began helping my parents with their real-estate business by managing their website. After taking a couple introductory computer science classes at Stanford, I re-designed their website over the summer of 2015 using a Wordpress Template and custom CSS. Additionally, I also worked with Northstar MLS to add in their IDX Search Engine into the website. My current responsibilities involve responding to online customer inquiries and updating information on the site as needed.","duration":"5 years 5 months","start_date":"2010-09-01","end_date":"2016-01-05","linkedin_company_url":"http://www.linkedin.com/"},{"title":"Tae Kwon Do Instructor","company":"American Karate Studio","description":"I was selected by my teacher to be an instructor when I was 14 years old, and I taught TaeKwonDo throughout high school up until I left for college. I led classes an average of two evenings per week, with students ranging from 4 years old - 64 years old. The curricula I taught consisted of traditional form, traditional kicks, self-defense techniques, sparring techniques, bo-staff techniques, and nun-chuck techniques. I was also responsible for teaching my studio's core tenets to our kids classes (i.e. Respect, Responsibility, and Discipline). Outside of teaching, my work also included coordinating the sale of equipment, writing up contracts for new students, and managing upkeep of the studio.","duration":"5 years 1 month","start_date":"2010-09-01","end_date":"2015-09-05","linkedin_company_url":"http://www.linkedin.com/"},{"title":"School Tutor","company":"Eden Prairie High School","description":"I spent five hours per week tutoring at my school's tutoring center throughout my last three years of high school. Topics I taught included Algebra, Calculus, Statistics, Writing, Chinese, Biology, Physics, and Chemistry. I helped walk students through problems they were struggling with, and I provided extra guidance to those who were seeking clarity on any given topic that I was familiar with.","duration":"2 years 10 months","start_date":"2011-09-01","end_date":"2014-06-02","linkedin_company_url":"http://www.linkedin.com/"},{"title":"Chapter President/ Fundraising Coordinator","company":"Partners In Health","description":"Led my school's chapter supporting Partner In Health's mission to make health care a universal human right. Organized a 1-year campaign to fundraise $2,000 for Partners In Health - Rwanda, a goal which was exceeded by $500. Fundraising activities consisted of selling FACE AIDS pins at school events, holding weekly meetings educating fellow students on global health care issues, and organizing a charity concert in support of PIH.","duration":"1 year 2 months","start_date":"2013-05-01","end_date":"2014-06-01","linkedin_company_url":"https://www.linkedin.com/company/partnersinhealth?trk=ppro_cprof","url":"http://www.pih.org","website":"http://www.pih.org","industry":"Hospital & Health Care","type":"Nonprofit","headquarters":"888 Commonwealth Avenue, 3rd floor\n\nBoston,\nMA\n02215\nUnited States","company_size":"10,001+ employees","founded":"1987","address":"888 Commonwealth Avenue, 3rd floor  Boston, MA 02215 United States"},{"title":"Blood Drive Coordinator","company":"Memorial Blood Centers","description":"Organized eight blood drives in my high school over two years, collecting a total of over 650 blood donations. Worked on a committee of five people to manage blood drive logistics including orchestrating publicity efforts, managing communications with the main Memorial Blood Centers Office, organizing sign-ups for blood donations, and running student check-in on the day of blood drives.","duration":"1 year 9 months","start_date":"2012-10-01","end_date":"2014-06-01","linkedin_company_url":"https://www.linkedin.com/company/memorial-blood-centers?trk=ppro_cprof","url":"http://www.MBC.org","website":"http://www.MBC.org","industry":"Hospital & Health Care","type":"Nonprofit","headquarters":"737 Pelham Blvd\n\nSt. Paul,\nMN\n55114\nUnited States","company_size":"201-500 employees","founded":"1948","address":"737 Pelham Blvd  St. Paul, MN 55114 United States"},{"title":"Chapter Co-President","company":"Amnesty International","description":"Held weekly meetings meant to educate our audience on human rights issues around the world. Notable Projects: - Blues Rock Concert (December 2013): Organized a concert consisting of musical acts from students in our high school. Raised $2,000 total, which was split between donating towards Treehuggers and HIV/AIDS Efforts.- Write for Rights (October 2013): Chapter wrote over 130 letters to advocate for anti-bullying in schools.- \"Jamnesty\" Concert (May 2014): Raised $600 for the International Campaign to Ban Land Mines.","duration":"1 year 2 months","start_date":"2013-05-01","end_date":"2014-06-01","linkedin_company_url":"https://www.linkedin.com/company/amnesty-international?trk=ppro_cprof"},{"title":"Treasurer/Event Coordinator","company":"Eden Prairie High School Student Government","description":"Elected each year to serve on my high school's student council, which primarily focused on organizing ways for students to give back to the community over the course of the year. As Treasurer, I was placed in charge of managing club funds, fundraising efforts, and cash flow.Notable Projects:- \"Charity Dream Date\" (February 2013 & February 2014): Worked alongside four other co-chairs to lead the organization of two community-wide charity auctions that raised a total of over $10,000 for the American Cancer Society and Make-A-Wish Foundation.- Charity Dodgeball Tournament (May 2013 & May 2014): Organized two charity dodgeball tournaments consisting of team entries from within Eden Prairie High School. Collectively raised over $1,200 from the two tournaments.- Books Beyond Borders Book Drive (October 2013): Worked with the other officers to organize a book drive that ultimately collected over 1,500 books to donate towards Books For Africa.","duration":"3 years 10 months","start_date":"2010-09-01","end_date":"2014-06-03","linkedin_company_url":"http://www.linkedin.com/"}],"recommended_visitors":[]}
