{"name":"Kashif Nazir","first_name":"Kashif","last_name":"Nazir","title":"Student at Stanford University","location":"Palo Alto","country":"California","industry":null,"summary":"Born in Southern California, moved to Riyadh, Saudi Arabia for high school where I studied and graduated from the American International School of Riyadh. Currently a sophomore at Stanford University pursuing a bachelor's degree in computer science.I am a self-motivated individual who loves computer science, games, and foreign cultures. I am looking for summer internship opportunities in software engineering where I can broaden my knowledge in the field and gain some practical experience.","picture":null,"projects":[],"linkedin_url":"https://www.linkedin.com/in/ksnazir","education":[{"name":"Stanford University","description":"Currently a sophomore pursuing a bachelor's degree in Computer Science at Stanford University.Activities and Societies: She++ #include initiative college advisor, member of SUAVE club","degree":", Computer Science","period":"2014 – 2018","start_date":"2014","end_date":"2018"}],"groups":[],"websites":[],"languages":[],"skills":["Java","C++","C","Python","Git","Unity","Adobe Creative Suite","Foreign Languages","Leadership","JavaScript","MySQL","IA32","Assembly Language"],"certifications":[],"organizations":[],"past_companies":[],"current_companies":[],"companies":[{"title":"Blood Donor Center Intern","company":"King Faisal Specialist Hospital & Research Centre (Gen. Org.)","description":"Worked with individuals across the various departments involved in the blood donation process. Created presentations to educate high school students in Riyadh, Saudi Arabia about the blood donation process and its importance.","duration":"2 months","start_date":"2014-02-01","end_date":"2014-03-02","linkedin_company_url":"https://www.linkedin.com/company/king-faisal-specialist-hospital?trk=ppro_cprof"},{"title":"Network Administrator","company":"IQRA Academy of Virginia","description":"Spent a part of summer volunteering at Iqra Academy, a local elementary school in Richmond, Virginia. Deployed Google Apps for Education for the school's network. Used Python to create, register, store, and manage user data through MySQL. Created a reusable interface for the school to allow school administrators to simply add new students/staff into the system. Held training seminar for faculty on how to use Google Apps as an educational tool and to facilitate learning.","duration":"9 months","start_date":"2015-08-01","end_date":"2016-04-04","linkedin_company_url":"https://www.linkedin.com/company/iqra-academy-of-virginia?trk=ppro_cprof"},{"title":"Project Leader","company":"Ethiopian International School of Riyadh","description":"Collected unused Macintosh desktops from schools around Riyadh, Saudi Arabia and raised money for educational software to donate to the Ethiopian International School of Riyadh. Once the computers and software were acquired, lead a team to install everything in the Ethiopian school's computer lab and educated instructors on how to use the software as teaching aids.","duration":"4 years 4 months","start_date":"2012-01-01","end_date":"2016-04-04","linkedin_company_url":"http://www.linkedin.com/"}],"recommended_visitors":[]}
